app/controllers/admins/genres_controller.rb

  def create
    @genre = Genre.new(genre_params)
    if @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "寺社仏閣"], ["created_at", "2020-07-09 14:20:24.340953"], ["updated_at", "2020-07-09 14:20:24.340953"]]