app/views/publics/places/index.html.slim

SELECT "places".* FROM "places"
SELECT  "place_images".* FROM "place_images" WHERE "place_images"."place_id" = ? ORDER BY "place_images"."id" ASC LIMIT ?  [["place_id", 1], ["LIMIT", 1]]
---
        td.col-md-auto
          = attachment_image_tag place.place_images.first,:image,fallback: "no_image.jpg",class:"place__image"