app/views/publics/places/show.html.slim


    - @place.place_images.each do |image|
---
SELECT "place_images".* FROM "place_images" WHERE "place_images"."place_id" = ?  [["place_id", 3]]