app/controllers/publics/places_controller.rb

  def create
    @place = Place.new(place_params)
    @place.place_images.map{|pi| pi.user = current_user} # PlaceImageのuser_idに値を渡す
    if @place.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "place_images" ("place_id", "user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "places" ("genre_id", "name", "explanation", "postcode", "address", "access", "tel", "url", "hours", "price", "holiday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @place.update(place_params_without_images) && PlaceImage.add_place_images([params[:place][:place_images_images]],@place,current_user)
---
UPDATE "places" SET "access" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["access", "こんにちは"], ["updated_at", "2020-07-10 17:15:00.023750"], ["id", 1]]

  def find_place
    @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]