app/controllers/publics/users_controller.rb

UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "cc6df1548c09ec682d17afd836c498ee0788bf8a2911fea21d14dda42dea"], ["updated_at", "2020-07-10 16:13:46.944504"], ["id", 1]]
---
  def update
    if @user.update(user_params)