app/models/place_image.rb

INSERT INTO "place_images" ("place_id", "user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def self.add_place_images(params,place,user) #既存のPlaceに追加するときだけ使う
    params.each do |image|
      unless image == "[]" #Refileで複数アップロードするとパラメーター最初に[]が入ってしまうため、はじく
        new_image = place.place_images.new(image: image)
        new_image.user = user
        new_image.save